In [1]:
from sklearn import datasets
import numpy as np

In [2]:
bs = datasets.load_boston()

In [3]:
bs

{'data': array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 1.5300e+01, 3.9690e+02,
         4.9800e+00],
        [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9690e+02,
         9.1400e+00],
        [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9283e+02,
         4.0300e+00],
        ...,
        [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         5.6400e+00],
        [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9345e+02,
         6.4800e+00],
        [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         7.8800e+00]]),
 'target': array([24. , 21.6, 34.7, 33.4, 36.2, 28.7, 22.9, 27.1, 16.5, 18.9, 15. ,
        18.9, 21.7, 20.4, 18.2, 19.9, 23.1, 17.5, 20.2, 18.2, 13.6, 19.6,
        15.2, 14.5, 15.6, 13.9, 16.6, 14.8, 18.4, 21. , 12.7, 14.5, 13.2,
        13.1, 13.5, 18.9, 20. , 21. , 24.7, 30.8, 34.9, 26.6, 25.3, 24.7,
        21.2, 19.3, 20. , 16.6, 14.4, 19.4, 19.7, 20.5, 25. , 23.4, 18.9,
        35.4, 24.7, 31.6, 23.3, 19.6, 18.7, 16. , 22.2, 25. , 33. , 23.5,
        19.4, 22. , 17.4, 20.9, 24.2, 21.7, 22.8, 23.4, 24.1, 21.4, 20. ,
        20.8, 21.2, 20.3, 28. , 23.9, 24.8, 22.9, 23.9, 26.6, 22.5, 22.2,
        23.6, 28.7, 22.6, 22. , 22.9, 25. , 20.6, 28.4, 21.4, 38.7, 43.8,
        33.2, 27.5, 26.5, 18.6, 19.3, 20.1, 19.5, 19.5, 20.4, 19.8, 19.4,
        21.7, 22.8, 18.8, 18.7, 18.5, 18.3, 21.2, 19.2, 20.4, 19.3, 22. ,
        20.3, 20.5, 17.3, 18.8, 21.4, 15.7, 16.2, 18. , 14.3, 19.2, 19.6,
        23. , 18.4, 15.6, 18.1, 17.4, 17.1, 13.3, 17.8, 14. , 14.4, 13.4,
        15.6, 11.8, 13.8, 15.6, 14.6, 17.8, 15.4, 21.5, 19.6, 15.3, 19.4,
        17. , 15.6, 13.1, 41.3, 24.3, 23.3, 27. , 50. , 50. , 50. , 22.7,
        25. , 50. , 23.8, 23.8, 22.3, 17.4, 19.1, 23.1, 23.6, 22.6, 29.4,
        23.2, 24.6, 29.9, 37.2, 39.8, 36.2, 37.9, 32.5, 26.4, 29.6, 50. ,
        32. , 29.8, 34.9, 37. , 30.5, 36.4, 31.1, 29.1, 50. , 33.3, 30.3,
        34.6, 34.9, 32.9, 24.1, 42.3, 48.5, 50. , 22.6, 24.4, 22.5, 24.4,
        20. , 21.7, 19.3, 22.4, 28.1, 23.7, 25. , 23.3, 28.7, 21.5, 23. ,
        26.7, 21.7, 27.5, 30.1, 44.8, 50. , 37.6, 31.6, 46.7, 31.5, 24.3,
        31.7, 41.7, 48.3, 29. , 24. , 25.1, 31.5, 23.7, 23.3, 22. , 20.1,
        22.2, 23.7, 17.6, 18.5, 24.3, 20.5, 24.5, 26.2, 24.4, 24.8, 29.6,
        42.8, 21.9, 20.9, 44. , 50. , 36. , 30.1, 33.8, 43.1, 48.8, 31. ,
        36.5, 22.8, 30.7, 50. , 43.5, 20.7, 21.1, 25.2, 24.4, 35.2, 32.4,
        32. , 33.2, 33.1, 29.1, 35.1, 45.4, 35.4, 46. , 50. , 32.2, 22. ,
        20.1, 23.2, 22.3, 24.8, 28.5, 37.3, 27.9, 23.9, 21.7, 28.6, 27.1,
        20.3, 22.5, 29. , 24.8, 22. , 26.4, 33.1, 36.1, 28.4, 33.4, 28.2,
        22.8, 20.3, 16.1, 22.1, 19.4, 21.6, 23.8, 16.2, 17.8, 19.8, 23.1,
        21. , 23.8, 23.1, 20.4, 18.5, 25. , 24.6, 23. , 22.2, 19.3, 22.6,
        19.8, 17.1, 19.4, 22.2, 20.7, 21.1, 19.5, 18.5, 20.6, 19. , 18.7,
        32.7, 16.5, 23.9, 31.2, 17.5, 17.2, 23.1, 24.5, 26.6, 22.9, 24.1,
        18.6, 30.1, 18.2, 20.6, 17.8, 21.7, 22.7, 22.6, 25. , 19.9, 20.8,
        16.8, 21.9, 27.5, 21.9, 23.1, 50. , 50. , 50. , 50. , 50. , 13.8,
        13.8, 15. , 13.9, 13.3, 13.1, 10.2, 10.4, 10.9, 11.3, 12.3,  8.8,
         7.2, 10.5,  7.4, 10.2, 11.5, 15.1, 23.2,  9.7, 13.8, 12.7, 13.1,
        12.5,  8.5,  5. ,  6.3,  5.6,  7.2, 12.1,  8.3,  8.5,  5. , 11.9,
        27.9, 17.2, 27.5, 15. , 17.2, 17.9, 16.3,  7. ,  7.2,  7.5, 10.4,
         8.8,  8.4, 16.7, 14.2, 20.8, 13.4, 11.7,  8.3, 10.2, 10.9, 11. ,
         9.5, 14.5, 14.1, 16.1, 14.3, 11.7, 13.4,  9.6,  8.7,  8.4, 12.8,
        10.5, 17.1, 18.4, 15.4, 10.8, 11.8, 14.9, 12.6, 14.1, 13. , 13.4,
        15.2, 16.1, 17.8, 14.9, 14.1, 12.7, 13.5, 14.9, 20. , 16.4, 17.7,
        19.5, 20.2, 21.4, 19.9, 19. , 19.1, 19.1, 20.1, 19.9, 19.6, 23.2,
        29.8, 13.8, 13.3, 16.7, 12. , 14.6, 21.4, 23. , 23.7, 25. , 21.8,
        20.6, 21.2, 19.1, 20.6, 15.2,  7. ,  8.1, 13.6, 20.1, 21.8, 24.5,
        23.1, 19.7, 18.3, 21.2, 17.5, 16.8, 22.4, 20.6, 23.9, 22. , 11.9]),
 'feature_names': array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
        'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7'),
 'DESCR': "Boston House Prices dataset\n===========================\n\nNotes\n------\nData Set Characteristics:  \n\n    :Number of Instances: 506 \n\n    :Number of Attributes: 13 numeric/categorical predictive\n    \n    :Median Value (attribute 14) is usually the target\n\n    :Attribute Information (in order):\n        - CRIM     per capita crime rate by town\n        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.\n        - INDUS    proportion of non-retail business acres per town\n        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)\n        - NOX      nitric oxides concentration (parts per 10 million)\n        - RM       average number of rooms per dwelling\n        - AGE      proportion of owner-occupied units built prior to 1940\n        - DIS      weighted distances to five Boston employment centres\n        - RAD      index of accessibility to radial highways\n        - TAX      full-value property-tax rate per $10,000\n        - PTRATIO  pupil-teacher ratio by town\n        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town\n        - LSTAT    % lower status of the population\n        - MEDV     Median value of owner-occupied homes in $1000's\n\n    :Missing Attribute Values: None\n\n    :Creator: Harrison, D. and Rubinfeld, D.L.\n\nThis is a copy of UCI ML housing dataset.\nhttp://archive.ics.uci.edu/ml/datasets/Housing\n\n\nThis dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.\n\nThe Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic\nprices and the demand for clean air', J. Environ. Economics & Management,\nvol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics\n...', Wiley, 1980.   N.B. Various transformations are used in the table on\npages 244-261 of the latter.\n\nThe Boston house-price data has been used in many machine learning papers that address regression\nproblems.   \n     \n**References**\n\n   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.\n   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.\n   - many more! (see http://archive.ics.uci.edu/ml/datasets/Housing)\n"}

In [5]:
X = bs.data
X.shape

(506, 13)

In [6]:
X[:4]

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, 0.0000e+00, 5.3800e-01,
        6.5750e+00, 6.5200e+01, 4.0900e+00, 1.0000e+00, 2.9600e+02,
        1.5300e+01, 3.9690e+02, 4.9800e+00],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, 0.0000e+00, 4.6900e-01,
        6.4210e+00, 7.8900e+01, 4.9671e+00, 2.0000e+00, 2.4200e+02,
        1.7800e+01, 3.9690e+02, 9.1400e+00],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, 0.0000e+00, 4.6900e-01,
        7.1850e+00, 6.1100e+01, 4.9671e+00, 2.0000e+00, 2.4200e+02,
        1.7800e+01, 3.9283e+02, 4.0300e+00],
       [3.2370e-02, 0.0000e+00, 2.1800e+00, 0.0000e+00, 4.5800e-01,
        6.9980e+00, 4.5800e+01, 6.0622e+00, 3.0000e+00, 2.2200e+02,
        1.8700e+01, 3.9463e+02, 2.9400e+00]])

In [11]:
y = bs.target
y.shape
y[:1]

array([24.])

In [9]:
bos = np.c_[y,X] #automatically the concatenation

In [10]:
bos[:3]

array([[2.4000e+01, 6.3200e-03, 1.8000e+01, 2.3100e+00, 0.0000e+00,
        5.3800e-01, 6.5750e+00, 6.5200e+01, 4.0900e+00, 1.0000e+00,
        2.9600e+02, 1.5300e+01, 3.9690e+02, 4.9800e+00],
       [2.1600e+01, 2.7310e-02, 0.0000e+00, 7.0700e+00, 0.0000e+00,
        4.6900e-01, 6.4210e+00, 7.8900e+01, 4.9671e+00, 2.0000e+00,
        2.4200e+02, 1.7800e+01, 3.9690e+02, 9.1400e+00],
       [3.4700e+01, 2.7290e-02, 0.0000e+00, 7.0700e+00, 0.0000e+00,
        4.6900e-01, 7.1850e+00, 6.1100e+01, 4.9671e+00, 2.0000e+00,
        2.4200e+02, 1.7800e+01, 3.9283e+02, 4.0300e+00]])

In [14]:
X.shape, y.shape, X.ndim, y.ndim

((506, 13), (506,), 2, 1)

In [17]:
y = y.reshape(-1, 1)
y.shape

(506, 1)

In [21]:
bos = np.concatenate((y,X),axis = 1)

In [22]:
bos.shape

(506, 14)

In [23]:
bos[0,0]

24.0

In [24]:
import pandas as pd

In [28]:
list(bs.feature_names)

['CRIM',
 'ZN',
 'INDUS',
 'CHAS',
 'NOX',
 'RM',
 'AGE',
 'DIS',
 'RAD',
 'TAX',
 'PTRATIO',
 'B',
 'LSTAT']

In [32]:
bosdf = pd.DataFrame(bos, columns = ['medv'] + list(bs.feature_names))
bosdf[:3]

,medv,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03

# PANDAS DATAFRAME

In [ ]:
#Heterogenous data-structure - unlike numpy arrays
#but each column will be homogenous
#so it's built over numpy and scipy and hence we can apply functions on pandas dataframe

### Create a df

In [33]:
#from a dictionary #values in the list format
dict1 = {
"country":["Brazil", "Russia", "India", "China", "South Africa"],
"capital":["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area":[8.516, 17.10, 3.286, 9.597,1.221],
"population":[200.4, 143.5, 1252, 1357,52.98] }

In [48]:
brics = pd.DataFrame(dict1, index = ['A', 'B', 'C', 'D', 'E'])
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [38]:
#you can control the number of columns being imported from the dictionary using the columns tab
df = pd.DataFrame(dict1, index = ['A','B','C', 'D', 'E'], columns = ['country', 'capital', 'area'])
df

        country    capital    area
A        Brazil   Brasilia   8.516
B        Russia     Moscow  17.100
C         India  New Delhi   3.286
D         China    Beijing   9.597
E  South Africa   Pretoria   1.221

In [42]:
#Each column / row a in df is a pandas series - it's a heterogenous unidimensionalds
dict_2 = {'country': "South Africa", 
          "Capital": "Pretoria", 
         "area": 1.22, 
          "population": 52.98}

In [44]:
x = pd.Series(dict_2)
x

country       South Africa
Capital           Pretoria
area                  1.22
population           52.98
dtype: object

In [46]:
type(x), type(df)

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [50]:
#creating a df from a list of dictionaries
pd.DataFrame([{"name": "Raj", "Age": 21}, {"name": "Mukul", "Age": 25 },{"name": "Rahul", "Age": 30}])

   Age   name
0   21    Raj
1   25  Mukul
2   30  Rahul

In [53]:
#creating a df using lists
lst_1 = ["Brazil", "Brasilia", 8.516, 200.40]
lst_2 = ["South Africa", "Pretoria", 1.22, 52.98]

In [55]:
pd.DataFrame(data = [lst_1, lst_2], columns = brics.columns)

        country   capital   area  population
0        Brazil  Brasilia  8.516      200.40
1  South Africa  Pretoria  1.220       52.98

In [56]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [59]:
#Create the dataframe using series
ser = pd.Series(data = [200.4, 123,231, 123], index = ["Brazil", "Russia","India", "China"])
ser

Brazil    200.4
Russia    123.0
India     231.0
China     123.0
dtype: float64

In [60]:
ser["Russia"]

123.0

In [61]:
pd.DataFrame(ser)

            0
Brazil  200.4
Russia  123.0
India   231.0
China   123.0

----

In [ ]:
#Row Indices and the column names

In [64]:
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [65]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [67]:
brics.columns = ['co', 'cap', 'ar', 'pop']
brics

             co        cap      ar      pop
A        Brazil   Brasilia   8.516   200.40
B        Russia     Moscow  17.100   143.50
C         India  New Delhi   3.286  1252.00
D         China    Beijing   9.597  1357.00
E  South Africa   Pretoria   1.221    52.98

In [69]:
brics.columns[1] = "capital"

TypeError: Index does not support mutable operations

In [71]:
x = list(brics.columns)
x

['co', 'cap', 'ar', 'pop']

In [73]:
x[2] = "area"
x[0] = "country"
x

['country', 'cap', 'area', 'pop']

In [75]:
brics.columns = x
brics

        country        cap    area      pop
A        Brazil   Brasilia   8.516   200.40
B        Russia     Moscow  17.100   143.50
C         India  New Delhi   3.286  1252.00
D         China    Beijing   9.597  1357.00
E  South Africa   Pretoria   1.221    52.98

In [76]:
#rename function
brics.rename(columns = {'cap': "capital", "pop": "population"}, inplace = True)

In [77]:
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [80]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [83]:
brics  = brics.rename(mapper = str.lower, axis = 'columns')

In [84]:
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [85]:
brics.rename(mapper = str.upper, axis = 'columns', inplace = True)

In [86]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION
A        Brazil   Brasilia   8.516      200.40
B        Russia     Moscow  17.100      143.50
C         India  New Delhi   3.286     1252.00
D         China    Beijing   9.597     1357.00
E  South Africa   Pretoria   1.221       52.98

In [87]:
brics.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [88]:
brics.set_index('COUNTRY', inplace = True)
brics

                CAPITAL    AREA  POPULATION
COUNTRY
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [89]:
brics.reset_index(inplace = True)

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [91]:
brics

                CAPITAL    AREA  POPULATION
COUNTRY
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [92]:
#brics.set_index('COUNTRY', inplace=True)

In [93]:
brics.rename(index = {'South Africa': "SA"}, inplace = True)

In [94]:
brics

           CAPITAL    AREA  POPULATION
COUNTRY
Brazil    Brasilia   8.516      200.40
Russia      Moscow  17.100      143.50
India    New Delhi   3.286     1252.00
China      Beijing   9.597     1357.00
SA        Pretoria   1.221       52.98

In [95]:
brics.reset_index(inplace = True)

In [96]:
brics

  COUNTRY    CAPITAL    AREA  POPULATION
0  Brazil   Brasilia   8.516      200.40
1  Russia     Moscow  17.100      143.50
2   India  New Delhi   3.286     1252.00
3   China    Beijing   9.597     1357.00
4      SA   Pretoria   1.221       52.98

-----

In [101]:
movies = pd.read_csv(r'C:\Users\Vaibhav\Desktop\BA\Datasets\movies.csv', index_col = 0, na_values = {'genres':['?', "NA", "1"]})
movies.head(3)

                           title                                       genres
movieId
1               Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
2                 Jumanji (1995)                   Adventure|Children|Fantasy
3        Grumpier Old Men (1995)                               Comedy|Romance

In [102]:
hy = pd.read_excel(r'C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 13 Association Rules Ex 2.xlsx', sheet_name= "Sheet1")

In [106]:
hy.head()

,Date,Bill Number,Item Desc,Time,Quantity,Rate,Tax,Discount,Total,Category
0,2010-04-01,G0470115,QUA MINERAL WATER(1000ML),13:15:11,1,50.0,11.88,0.0,61.88,BEVERAGE
1,2010-04-01,G0470115,MONSOON MALABAR (AULAIT),13:15:11,1,100.0,23.75,0.0,123.75,BEVERAGE
2,2010-04-01,G0470116,MASALA CHAI CUTTING,13:17:35,1,40.0,9.50,0.0,49.50,BEVERAGE
3,2010-04-01,G0470117,QUA MINERAL WATER(1000ML),13:19:55,1,50.0,11.88,0.0,61.88,BEVERAGE
4,2010-04-01,G0470283,MOROCCAN MINT TEA,01:20:18,1,45.0,10.69,0.0,55.69,BEVERAGE

In [107]:
hy.tail()

,Date,Bill Number,Item Desc,Time,Quantity,Rate,Tax,Discount,Total,Category
145825,2010-05-22,N0028716,ZINZI WHITE (GLS),21:43:55,2,150.0,78.0,0.0,378.0,LIQUOR
145826,2010-04-27,N0028343,ZINZI WHITE (GLS),20:52:11,2,150.0,78.0,0.0,378.0,LIQUOR
145827,2010-05-28,N0028835,ZINZI WHITE (GLS),01:03:37,3,150.0,117.0,0.0,567.0,LIQUOR
145828,2010-04-30,N0028399,ZINZI WHITE (GLS),23:44:37,1,150.0,39.0,0.0,189.0,LIQUOR
145829,2010-07-09,N0029472,ZINZI WHITE (BTL),00:31:51,1,700.0,182.0,0.0,882.0,LIQUOR

In [104]:
hy.shape

(145830, 10)

In [109]:
movies = pd.read_table(r"C:\Users\Vaibhav\Desktop\BA\simplilearn\Python\DataSciencePy\Projects for Submission\Project4_Movielens\movies.dat", sep ='::', header = None, names = ["MovieID","Title", "Genres"])

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.
C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [110]:
movies.head()

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [112]:
#movies

In [113]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3883 entries, 0 to 3882
Data columns (total 3 columns):
MovieID    3883 non-null int64
Title      3883 non-null object
Genres     3883 non-null object
dtypes: int64(1), object(2)
memory usage: 91.1+ KB

In [114]:
movies.dtypes

MovieID     int64
Title      object
Genres     object
dtype: object

In [118]:
hyp = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 8-9 Hypothesis Testing Ex 1.csv", index_col = 0)

In [119]:
hyp.head(3)

     Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
ID
70        0     4    1       1     1    57     52     41     47   57
121       1     4    2       1     3    68     59     53     63   61
86        0     4    3       1     1    44     33     54     58   31

In [120]:
hyp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 200 entries, 70 to 137
Data columns (total 10 columns):
Gender    200 non-null int64
Race      200 non-null int64
SEB       200 non-null int64
School    200 non-null int64
Prog      200 non-null int64
Read      200 non-null int64
Write     200 non-null int64
Math1     200 non-null int64
Math2     200 non-null int64
SST       200 non-null int64
dtypes: int64(10)
memory usage: 17.2 KB

In [122]:
#To change the dtype of gender to boolean
type(hyp.Gender)

pandas.core.series.Series

In [124]:
hyp.Gender = hyp.Gender.astype(np.bool)
hyp.head(3)

     Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
ID
70    False     4    1       1     1    57     52     41     47   57
121    True     4    2       1     3    68     59     53     63   61
86    False     4    3       1     1    44     33     54     58   31

In [125]:
hyp = hyp.astype({'Gender': str, 'Read': np.float64})
hyp.head(3)

    Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
ID
70   False     4    1       1     1  57.0     52     41     47   57
121   True     4    2       1     3  68.0     59     53     63   61
86   False     4    3       1     1  44.0     33     54     58   31

In [126]:
hyp.Math1 = hyp.Math1.astype(np.float64)

In [ ]:
#suppose I want to convert multiple cols into categorical type

In [127]:
categorical = list(hyp.columns)[0:5]

In [128]:
for i in categorical:
    hyp[i] = hyp[i].astype('category')
hyp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 200 entries, 70 to 137
Data columns (total 10 columns):
Gender    200 non-null category
Race      200 non-null category
SEB       200 non-null category
School    200 non-null category
Prog      200 non-null category
Read      200 non-null float64
Write     200 non-null int64
Math1     200 non-null float64
Math2     200 non-null int64
SST       200 non-null int64
dtypes: category(5), float64(2), int64(3)
memory usage: 10.9 KB

In [129]:
np.unique(hyp.Gender)

array(['False', 'True'], dtype=object)

In [130]:
pd.value_counts(hyp.Gender)

True     109
False     91
Name: Gender, dtype: int64

### Slicing Dataframes

In [131]:
brics

  COUNTRY    CAPITAL    AREA  POPULATION
0  Brazil   Brasilia   8.516      200.40
1  Russia     Moscow  17.100      143.50
2   India  New Delhi   3.286     1252.00
3   China    Beijing   9.597     1357.00
4      SA   Pretoria   1.221       52.98

In [144]:
brics.set_index("COUNTRY")
brics

           CAPITAL    AREA  POPULATION
COUNTRY
Brazil    Brasilia   8.516      200.40
Russia      Moscow  17.100      143.50
India    New Delhi   3.286     1252.00
China      Beijing   9.597     1357.00
SA        Pretoria   1.221       52.98

In [146]:
#access the rows
brics[:4] #all the list slicing ways are applicable here

           CAPITAL    AREA  POPULATION
COUNTRY
Brazil    Brasilia   8.516       200.4
Russia      Moscow  17.100       143.5
India    New Delhi   3.286      1252.0
China      Beijing   9.597      1357.0

In [134]:
brics[4] #integer indexing does not work

COUNTRY             SA
CAPITAL       Pretoria
AREA             1.221
POPULATION       52.98
Name: 4, dtype: object

In [137]:
#to retrieve a few columns
l = brics[['COUNTRY', 'CAPITAL']]
l

  COUNTRY    CAPITAL
0  Brazil   Brasilia
1  Russia     Moscow
2   India  New Delhi
3   China    Beijing
4      SA   Pretoria

In [138]:
#To retrieve a unidimensional series
brics['COUNTRY']

0    Brazil
1    Russia
2     India
3     China
4        SA
Name: COUNTRY, dtype: object

In [139]:
#To retrieve a unidimensional series
brics.COUNTRY

0    Brazil
1    Russia
2     India
3     China
4        SA
Name: COUNTRY, dtype: object

In [147]:
brics

           CAPITAL    AREA  POPULATION
COUNTRY
Brazil    Brasilia   8.516      200.40
Russia      Moscow  17.100      143.50
India    New Delhi   3.286     1252.00
China      Beijing   9.597     1357.00
SA        Pretoria   1.221       52.98

In [154]:
brics.reset_index(inplace=True)

In [160]:
np.logical_and(brics.CAPITAL == "New Delhi", brics.COUNTRY =="China")

0    False
1    False
2    False
3    False
4    False
Name: CAPITAL, dtype: bool

In [167]:
np.logical_or(brics.CAPITAL == "New Delhi", brics.AREA<10)

COUNTRY
Brazil     True
Russia    False
India      True
China      True
SA         True
Name: CAPITAL, dtype: bool

In [162]:
brics[np.logical_or(brics.CAPITAL == "New Delhi", brics.AREA<10)]

  COUNTRY    CAPITAL   AREA  POPULATION
0  Brazil   Brasilia  8.516      200.40
2   India  New Delhi  3.286     1252.00
3   China    Beijing  9.597     1357.00
4      SA   Pretoria  1.221       52.98

In [149]:
brics[[True, False, True, False, True]]

           CAPITAL   AREA  POPULATION
COUNTRY
Brazil    Brasilia  8.516      200.40
India    New Delhi  3.286     1252.00
SA        Pretoria  1.221       52.98

In [ ]:
#loc command

In [163]:
brics.set_index("COUNTRY", inplace=True)

In [170]:
brics.loc['Brazil', 'CAPITAL']

'Brasilia'

In [173]:
brics.loc[['Brazil', 'Russia', 'India'], ['CAPITAL', 'POPULATION']]

           CAPITAL  POPULATION
COUNTRY
Brazil    Brasilia       200.4
Russia      Moscow       143.5
India    New Delhi      1252.0

In [174]:
brics.loc['Brazil']

CAPITAL       Brasilia
AREA             8.516
POPULATION       200.4
Name: Brazil, dtype: object

In [177]:
brics[['CAPITAL']]

           CAPITAL
COUNTRY
Brazil    Brasilia
Russia      Moscow
India    New Delhi
China      Beijing
SA        Pretoria

In [178]:
#bosdf - to get the top 100 rows
bosdf[:101]

,medv,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
3,33.4,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94
4,36.2,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33
5,28.7,0.02985,0.0,2.18,0.0,0.458,6.430,58.7,6.0622,3.0,222.0,18.7,394.12,5.21
6,22.9,0.08829,12.5,7.87,0.0,0.524,6.012,66.6,5.5605,5.0,311.0,15.2,395.60,12.43
7,27.1,0.14455,12.5,7.87,0.0,0.524,6.172,96.1,5.9505,5.0,311.0,15.2,396.90,19.15
8,16.5,0.21124,12.5,7.87,0.0,0.524,5.631,100.0,6.0821,5.0,311.0,15.2,386.63,29.93
9,18.9,0.17004,12.5,7.87,0.0,0.524,6.004,85.9,6.5921,5.0,311.0,15.2,386.71,17.10
10,15.0,0.22489,12.5,7.87,0.0,0.524,6.377,94.3,6.3467,5.0,311.0,15.2,392.52,20.45
11,18.9,0.11747,12.5,7.87,0.0,0.524,6.009,82.9,6.2267,5.0,311.0,15.2,396.90,13.27
12,21.7,0.09378,12.5,7.87,0.0,0.524,5.889,39.0,5.4509,5.0,311.0,15.2,390.50,15.71
13,20.4,0.62976,0.0,8.14,0.0,0.538,5.949,61.8,4.7075,4.0,307.0,21.0,396.90,8.26
14,18.2,0.63796,0.0,8.14,0.0,0.538,6.096,84.5,4.4619,4.0,307.0,21.0,380.02,10.26
15,19.9,0.62739,0.0,8.14,0.0,0.538,5.834,56.5,4.4986,4.0,307.0,21.0,395.62,8.47
16,23.1,1.05393,0.0,8.14,0.0,0.538,5.935,29.3,4.4986,4.0,307.0,21.0,386.85,6.58
17,17.5,0.78420,0.0,8.14,0.0,0.538,5.990,81.7,4.2579,4.0,307.0,21.0,386.75,14.67
18,20.2,0.80271,0.0,8.14,0.0,0.538,5.456,36.6,3.7965,4.0,307.0,21.0,288.99,11.69
19,18.2,0.72580,0.0,8.14,0.0,0.538,5.727,69.5,3.7965,4.0,307.0,21.0,390.95,11.28
20,13.6,1.25179,0.0,8.14,0.0,0.538,5.570,98.1,3.7979,4.0,307.0,21.0,376.57,21.02
21,19.6,0.85204,0.0,8.14,0.0,0.538,5.965,89.2,4.0123,4.0,307.0,21.0,392.53,13.83
22,15.2,1.23247,0.0,8.14,0.0,0.538,6.142,91.7,3.9769,4.0,307.0,21.0,396.90,18.72
23,14.5,0.98843,0.0,8.14,0.0,0.538,5.813,100.0,4.0952,4.0,307.0,21.0,394.54,19.88
24,15.6,0.75026,0.0,8.14,0.0,0.538,5.924,94.1,4.3996,4.0,307.0,21.0,394.33,16.30
25,13.9,0.84054,0.0,8.14,0.0,0.538,5.599,85.7,4.4546,4.0,307.0,21.0,303.42,16.51
26,16.6,0.67191,0.0,8.14,0.0,0.538,5.813,90.3,4.6820,4.0,307.0,21.0,376.88,14.81
27,14.8,0.95577,0.0,8.14,0.0,0.538,6.047,88.8,4.4534,4.0,307.0,21.0,306.38,17.28
28,18.4,0.77299,0.0,8.14,0.0,0.538,6.495,94.4,4.4547,4.0,307.0,21.0,387.94,12.80
29,21.0,1.00245,0.0,8.14,0.0,0.538,6.674,87.3,4.2390,4.0,307.0,21.0,380.23,11.98
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
71,21.7,0.15876,0.0,10.81,0.0,0.413,5.961,17.5,5.2873,4.0,305.0,19.2,376.94,9.88
72,22.8,0.09164,0.0,10.81,0.0,0.413,6.065,7.8,5.2873,4.0,305.0,19.2,390.91,5.52
73,23.4,0.19539,0.0,10.81,0.0,0.413,6.245,6.2,5.2873,4.0,305.0,19.2,377.17,7.54
74,24.1,0.07896,0.0,12.83,0.0,0.437,6.273,6.0,4.2515,5.0,398.0,18.7,394.92,6.78
75,21.4,0.09512,0.0,12.83,0.0,0.437,6.286,45.0,4.5026,5.0,398.0,18.7,383.23,8.94
76,20.0,0.10153,0.0,12.83,0.0,0.437,6.279,74.5,4.0522,5.0,398.0,18.7,373.66,11.97
77,20.8,0.08707,0.0,12.83,0.0,0.437,6.140,45.8,4.0905,5.0,398.0,18.7,386.96,10.27
78,21.2,0.05646,0.0,12.83,0.0,0.437,6.232,53.7,5.0141,5.0,398.0,18.7,386.40,12.34
79,20.3,0.08387,0.0,12.83,0.0,0.437,5.874,36.6,4.5026,5.0,398.0,18.7,396.06,9.10
80,28.0,0.04113,25.0,4.86,0.0,0.426,6.727,33.5,5.4007,4.0,281.0,19.0,396.90,5.29
81,23.9,0.04462,25.0,4.86,0.0,0.426,6.619,70.4,5.4007,4.0,281.0,19.0,395.63,7.22
82,24.8,0.03659,25.0,4.86,0.0,0.426,6.302,32.2,5.4007,4.0,281.0,19.0,396.90,6.72
83,22.9,0.03551,25.0,4.86,0.0,0.426,6.167,46.7,5.4007,4.0,281.0,19.0,390.64,7.51
84,23.9,0.05059,0.0,4.49,0.0,0.449,6.389,48.0,4.7794,3.0,247.0,18.5,396.90,9.62
85,26.6,0.05735,0.0,4.49,0.0,0.449,6.630,56.1,4.4377,3.0,247.0,18.5,392.30,6.53
86,22.5,0.05188,0.0,4.49,0.0,0.449,6.015,45.1,4.4272,3.0,247.0,18.5,395.99,12.86
87,22.2,0.07151,0.0,4.49,0.0,0.449,6.121,56.8,3.7476,3.0,247.0,18.5,395.15,8.44
88,23.6,0.05660,0.0,3.41,0.0,0.489,7.007,86.3,3.4217,2.0,270.0,17.8,396.90,5.50
89,28.7,0.05302,0.0,3.41,0.0,0.489,7.079,63.1,3.4145,2.0,270.0,17.8,396.06,5.70
90,22.6,0.04684,0.0,3.41,0.0,0.489,6.417,66.1,3.0923,2.0,270.0,17.8,392.18,8.81
91,22.0,0.03932,0.0,3.41,0.0,0.489,6.405,73.9,3.0921,2.0,270.0,17.8,393.55,8.20
92,22.9,0.04203,28.0,15.04,0.0,0.464,6.442,53.6,3.6659,4.0,270.0,18.2,395.01,8.16
93,25.0,0.02875,28.0,15.04,0.0,0.464,6.211,28.9,3.6659,4.0,270.0,18.2,396.33,6.21
94,20.6,0.04294,28.0,15.04,0.0,0.464,6.249,77.3,3.6150,4.0,270.0,18.2,396.90,10.59
95,28.4,0.12204,0.0,2.89,0.0,0.445,6.625,57.8,3.4952,2.0,276.0,18.0,357.98,6.65
96,21.4,0.11504,0.0,2.89,0.0,0.445,6.163,69.6,3.4952,2.0,276.0,18.0,391.83,11.34
97,38.7,0.12083,0.0,2.89,0.0,0.445,8.069,76.0,3.4952,2.0,276.0,18.0,396.90,4.21
98,43.8,0.08187,0.0,2.89,0.0,0.445,7.820,36.9,3.4952,2.0,276.0,18.0,393.53,3.57
99,33.2,0.06860,0.0,2.89,0.0,0.445,7.416,62.5,3.4952,2.0,276.0,18.0,396.90,6.19
100,27.5,0.14866,0.0,8.56,0.0,0.520,6.727,79.9,2.7778,5.0,384.0,20.9,394.76,9.42

In [185]:
brics.loc[:, 'POPULATION']

COUNTRY
Brazil     200.40
Russia     143.50
India     1252.00
China     1357.00
SA          52.98
Name: POPULATION, dtype: float64

In [187]:
brics.loc['Brazil': 'China':2, :]

           CAPITAL   AREA  POPULATION
COUNTRY
Brazil    Brasilia  8.516       200.4
India    New Delhi  3.286      1252.0

In [189]:
brics.loc['China': 'Brazil':-1, 'AREA':]

           AREA  POPULATION
COUNTRY
China     9.597      1357.0
India     3.286      1252.0
Russia   17.100       143.5
Brazil    8.516       200.4

In [190]:
brics

           CAPITAL    AREA  POPULATION
COUNTRY
Brazil    Brasilia   8.516      200.40
Russia      Moscow  17.100      143.50
India    New Delhi   3.286     1252.00
China      Beijing   9.597     1357.00
SA        Pretoria   1.221       52.98

In [192]:
brics.loc[[True, False, True, False, False], [True, False, True]]

           CAPITAL  POPULATION
COUNTRY
Brazil    Brasilia       200.4
India    New Delhi      1252.0

In [193]:
brics.loc[brics.CAPITAL.isin(['Moscow', 'Beijing'])]

         CAPITAL    AREA  POPULATION
COUNTRY
Russia    Moscow  17.100       143.5
China    Beijing   9.597      1357.0

In [194]:
brics.CAPITAL.isin(['Moscow', 'Beijing'])

COUNTRY
Brazil    False
Russia     True
India     False
China      True
SA        False
Name: CAPITAL, dtype: bool

In [195]:
brics.loc[:, brics.columns.isin(['CAPITAL', 'AREA'])]

           CAPITAL    AREA
COUNTRY
Brazil    Brasilia   8.516
Russia      Moscow  17.100
India    New Delhi   3.286
China      Beijing   9.597
SA        Pretoria   1.221

In [196]:
bosdf.loc[:3,:] #here the row indexes are the integers, and hence we are giving integer values for row indices

,medv,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
3,33.4,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94

In [ ]:
#iloc - row number and collumn numbers

In [184]:
brics.iloc[:4,2]

COUNTRY
Brazil     200.4
Russia     143.5
India     1252.0
China     1357.0
Name: POPULATION, dtype: float64

In [199]:
brics.iloc[[1],:2] #gives the first row (and 2nd col) in df format

        CAPITAL  AREA
COUNTRY
Russia   Moscow  17.1

In [ ]:
brics.iloc[1,:2] #gives in the series format

In [200]:
brics.iloc[[1]]

        CAPITAL  AREA  POPULATION
COUNTRY
Russia   Moscow  17.1       143.5

In [201]:
brics.iloc[[1,3]]

         CAPITAL    AREA  POPULATION
COUNTRY
Russia    Moscow  17.100       143.5
China    Beijing   9.597      1357.0

In [202]:
brics.iloc[-3:-1, 1:3]

          AREA  POPULATION
COUNTRY
India    3.286      1252.0
China    9.597      1357.0

In [203]:
brics.iloc[:, brics.columns.isin(['CAPITAL', 'A', 'AREA'])]

           CAPITAL    AREA
COUNTRY
Brazil    Brasilia   8.516
Russia      Moscow  17.100
India    New Delhi   3.286
China      Beijing   9.597
SA        Pretoria   1.221

In [205]:
brics.iloc[[0,1,2],[0,2]]

           CAPITAL  POPULATION
COUNTRY
Brazil    Brasilia       200.4
Russia      Moscow       143.5
India    New Delhi      1252.0

In [207]:
bosdf.loc[[0,1,2], ['medv', 'CRIM']]

   medv     CRIM
0  24.0  0.00632
1  21.6  0.02731
2  34.7  0.02729

In [ ]:
#iloc - helps us retrieving based on the row numbers and colunmn number
#loc - helps us retrieve based on row indices and column indices

In [ ]:
#isin function and in function

In [208]:
brics.columns.isin(['country', 'CAPITAL', 'AREA']) #gives t and false corresponding to each component

array([ True,  True, False])

In [209]:
brics.columns

Index(['CAPITAL', 'AREA', 'POPULATION'], dtype='object')

In [212]:
list(brics.columns) in ['country', 'CAPITAL', 'AREA']

False

In [213]:
list(brics.columns)

['CAPITAL', 'AREA', 'POPULATION']

In [214]:
'CAPITAL' in ['country', 'CAPITAL', 'AREA']

True

In [215]:
hyp.head(3)

    Gender Race SEB School Prog  Read  Write  Math1  Math2  SST
ID
70   False    4   1      1    1  57.0     52   41.0     47   57
121   True    4   2      1    3  68.0     59   53.0     63   61
86   False    4   3      1    1  44.0     33   54.0     58   31

In [ ]:
#to retrieve all rows having races 1 and 2

In [218]:
hyp[hyp.Race.isin([1,2])].head()

   Gender Race SEB School Prog  Read  Write  Math1  Math2  SST
ID
11  False    1   2      1    2  34.0     46   45.0     39   36
20  False    1   3      1    2  60.0     52   57.0     61   61
12  False    1   2      1    3  37.0     44   45.0     39   46
29  False    2   1      1    1  52.0     44   49.0     55   41
16  False    1   1      1    3  47.0     31   44.0     36   36